Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Инвентарь</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общежитие</Name>
					<Comment>Общежитие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияИнвентаризации</Name>
					<Comment>Дата проведения инвентаризации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнаруженыНесоответствия</Name>
					<Comment>Обнаружены несоответствия</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_СломаноУтеряно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТЧ_СломаноУтеряноНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	ТекущаяСтрока.Цена = ПолучитьРозничнуюЦену(Объект.Дата,ТекущаяСтрока.Номенклатура);
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Функция ПолучитьРозничнуюЦену(АктуальнаяДата, Номенклатура)
	Результат = РозничнаяЦена(АктуальнаяДата, Номенклатура);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТЧ_СломаноУтеряно.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СломаноУтеряноКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_СломаноУтеряно.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СломаноУтеряноЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧ_СломаноУтеряно.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);     
	Объект.СуммаДокумента = Объект.ТЧ_ПереченьНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженыНесоответствияПриИзменении(Элемент)
	Если Объект.ОбнаруженыНесоответствия Тогда
		Элементы.Студент.Видимость = Истина;
		Элементы.ТЧ_СломаноУтеряно.Видимость = Истина;
	Иначе
		Элементы.Студент.Видимость = Ложь;
		Элементы.ТЧ_СломаноУтеряно.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
